In [1]:
import pandas as pd
import numpy as np

from IPython.core.interactiveshell import InteractiveShell

InteractiveShell.ast_node_interactivity = "all"

# Question 1

In [2]:
data = {
    "ID": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "Name": [
        "Alice",
        "Bob",
        "Charlie",
        "David",
        "Eva",
        "Frank",
        "Grace",
        "Hannah",
        "Ivy",
        "Jack",
    ],
    "Age": [23, 45, 25, 35, 33, 42, 29, 24, 41, 28],
    "City": [
        "New York",
        "Los Angeles",
        "New York",
        "Chicago",
        "New York",
        "Los Angeles",
        "Chicago",
        "Chicago",
        "New York",
        "Los Angeles",
    ],
    "Score": [85, 67, 93, 45, 78, 82, 74, 66, 89, 77],
}

data = pd.DataFrame(data)
data

   ID     Name  Age         City  Score
0   1    Alice   23     New York     85
1   2      Bob   45  Los Angeles     67
2   3  Charlie   25     New York     93
3   4    David   35      Chicago     45
4   5      Eva   33     New York     78
5   6    Frank   42  Los Angeles     82
6   7    Grace   29      Chicago     74
7   8   Hannah   24      Chicago     66
8   9      Ivy   41     New York     89
9  10     Jack   28  Los Angeles     77

1. Filter the dataset to find all individuals who live in New York

In [3]:
new_york_residents_data = data[data["City"] == "New York"]
new_york_residents_data

   ID     Name  Age      City  Score
0   1    Alice   23  New York     85
2   3  Charlie   25  New York     93
4   5      Eva   33  New York     78
8   9      Ivy   41  New York     89

2. Calculate the average age of individuals in the dataset.

In [4]:
average_age = data["Age"].mean()
average_age

32.5

3. Sort the dataset by the 'Score' column in descending order.

In [5]:
sorted_score_data = data.sort_values(by="Score", ascending=False)
sorted_score_data

   ID     Name  Age         City  Score
2   3  Charlie   25     New York     93
8   9      Ivy   41     New York     89
0   1    Alice   23     New York     85
5   6    Frank   42  Los Angeles     82
4   5      Eva   33     New York     78
9  10     Jack   28  Los Angeles     77
6   7    Grace   29      Chicago     74
1   2      Bob   45  Los Angeles     67
7   8   Hannah   24      Chicago     66
3   4    David   35      Chicago     45

4. Find the maximum score for each city.

In [6]:
city_max_score = data.groupby("City")["Score"].max()
city_max_score

City
Chicago        74
Los Angeles    82
New York       93
Name: Score, dtype: int64

5. Add a new column 'Age Group' to the dataset which categorizes individuals as 'Young' (Age < 30), 'Middle-aged' (30 <= Age < 40), and 'Old' (Age >= 40).

In [7]:
condtions = [
    data["Age"] < 30,
    (data["Age"] >= 30) & (data["Age"] < 40),
    data["Age"] >= 40,
]
choices = ["Young", "Middle-aged", "Old"]
data["Age Group"] = np.select(condlist=condtions, choicelist=choices)
data

   ID     Name  Age         City  Score    Age Group
0   1    Alice   23     New York     85        Young
1   2      Bob   45  Los Angeles     67          Old
2   3  Charlie   25     New York     93        Young
3   4    David   35      Chicago     45  Middle-aged
4   5      Eva   33     New York     78  Middle-aged
5   6    Frank   42  Los Angeles     82          Old
6   7    Grace   29      Chicago     74        Young
7   8   Hannah   24      Chicago     66        Young
8   9      Ivy   41     New York     89          Old
9  10     Jack   28  Los Angeles     77        Young

6. Find the average score for each age group created in the previous question.

In [8]:
average_score_age_group = data.groupby("Age Group")["Score"].mean()
average_score_age_group

Age Group
Middle-aged    61.500000
Old            79.333333
Young          79.000000
Name: Score, dtype: float64

7. Identify the individual(s) with the highest score in each city.

In [9]:
data.groupby("City")

8. Find the difference between the highest and lowest scores in each city.

In [10]:
delta_scores = data.groupby("City").apply(lambda x: x["Score"].max() - x["Score"].min())
delta_scores

/var/folders/3t/7vty8fs14dx8q_szrq7gcm5m0000gq/T/ipykernel_90663/4154268690.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  delta_scores = data.groupby("City").apply(lambda x: x["Score"].max() - x["Score"].min())

City
Chicago        29
Los Angeles    15
New York       15
dtype: int64

9. Create a pivot table that shows the average score and count of individuals for each combination of 'City' and 'Age Group'.

In [11]:
pd.pivot_table(
    data=data, index=["City", "Age Group"], aggfunc=["mean", "count"], values=["Score"]
)

                         mean count
                        Score Score
City        Age Group
Chicago     Middle-aged  45.0     1
            Young        70.0     2
Los Angeles Old          74.5     2
            Young        77.0     1
New York    Middle-aged  78.0     1
            Old          89.0     1
            Young        89.0     2

10. Find the names of individuals who have a score greater than 80.

In [12]:
high_scorers_names = data[data["Score"] > 80]["Name"]
high_scorers_names

0      Alice
2    Charlie
5      Frank
8        Ivy
Name: Name, dtype: object

11. Calculate the median age of the individuals.

In [13]:
median_age = data["Age"].median()
median_age

31.0

12. Find the total number of individuals living in each city.

In [14]:
cnt_individuals_per_city = data.groupby(["City"])["Name"].count()
cnt_individuals_per_city

City
Chicago        3
Los Angeles    3
New York       4
Name: Name, dtype: int64

13. Calculate the standard deviation of ages for individuals in each city.

In [15]:
age_std_city = data.groupby("City")["Age"].std()
age_std_city

City
Chicago        5.507571
Los Angeles    9.073772
New York       8.225975
Name: Age, dtype: float64

14. Filter the dataset to find all individuals who are either younger than 30 or have a score higher than 75.

In [16]:
filt_data = data[((data["Age"] < 30) | (data["Score"] > 75))]
filt_data

   ID     Name  Age         City  Score    Age Group
0   1    Alice   23     New York     85        Young
2   3  Charlie   25     New York     93        Young
4   5      Eva   33     New York     78  Middle-aged
5   6    Frank   42  Los Angeles     82          Old
6   7    Grace   29      Chicago     74        Young
7   8   Hannah   24      Chicago     66        Young
8   9      Ivy   41     New York     89          Old
9  10     Jack   28  Los Angeles     77        Young

15. Add a new column 'Score Category' to the dataset which categorizes scores as 'High' (Score > 80), 'Medium' (60 < Score <= 80), and 'Low' (Score <= 60).

In [17]:
conditions = [
    data["Score"] > 80,
    (data["Score"] <= 80) & (data["Score"] > 60),
    (data["Score"] <= 60),
]
choices = ["High", "Medium", "Low"]

data["Score Category"] = np.select(conditions, choices)
data

   ID     Name  Age         City  Score    Age Group Score Category
0   1    Alice   23     New York     85        Young           High
1   2      Bob   45  Los Angeles     67          Old         Medium
2   3  Charlie   25     New York     93        Young           High
3   4    David   35      Chicago     45  Middle-aged            Low
4   5      Eva   33     New York     78  Middle-aged         Medium
5   6    Frank   42  Los Angeles     82          Old           High
6   7    Grace   29      Chicago     74        Young         Medium
7   8   Hannah   24      Chicago     66        Young         Medium
8   9      Ivy   41     New York     89          Old           High
9  10     Jack   28  Los Angeles     77        Young         Medium

16. Identify the city with the highest average score.

In [18]:
highest_average_city = data.groupby("City")["Score"].mean().idxmax()
highest_average_city

'New York'

17. Find the top three individuals with the highest scores and their respective cities.

In [19]:
top3_scorers = data.loc[data["Score"].nlargest(3).index][["Name", "City"]]
top3_scorers

      Name      City
2  Charlie  New York
8      Ivy  New York
0    Alice  New York

18. Calculate the correlation between 'Age' and 'Score' for each city.

In [20]:
age_score_correlation = data.groupby("City").apply(
    lambda group: group["Age"].corr(group["Score"])
)
age_score_correlation

/var/folders/3t/7vty8fs14dx8q_szrq7gcm5m0000gq/T/ipykernel_90663/3340489709.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  age_score_correlation = data.groupby("City").apply(

City
Chicago       -0.737453
Los Angeles   -0.348715
New York      -0.123531
dtype: float64

19. Find the individual who has the closest score to the average score of their city.

In [21]:
data.iloc[
    data.groupby("City")
    .apply(lambda group: abs(group["Score"].mean() - group["Score"]).idxmin())
    .values
]

/var/folders/3t/7vty8fs14dx8q_szrq7gcm5m0000gq/T/ipykernel_90663/3868212238.py:3: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  .apply(lambda group: abs(group["Score"].mean() - group["Score"]).idxmin())

   ID    Name  Age         City  Score Age Group Score Category
7   8  Hannah   24      Chicago     66     Young         Medium
9  10    Jack   28  Los Angeles     77     Young         Medium
0   1   Alice   23     New York     85     Young           High

20. For each age group, determine the individual who has the maximum score and their city.

In [22]:
highest_scorers_age_groups = data.loc[data.groupby("Age Group")["Score"].idxmax()][
    "Name"
]
highest_scorers_age_groups

4        Eva
8        Ivy
2    Charlie
Name: Name, dtype: object

21. Create a new column 'Rank' which ranks individuals within their city based on their score (highest score gets rank 1).

In [23]:
data["Rank"] = data["Score"].rank(ascending=False)
data

   ID     Name  Age         City  Score    Age Group Score Category  Rank
0   1    Alice   23     New York     85        Young           High   3.0
1   2      Bob   45  Los Angeles     67          Old         Medium   8.0
2   3  Charlie   25     New York     93        Young           High   1.0
3   4    David   35      Chicago     45  Middle-aged            Low  10.0
4   5      Eva   33     New York     78  Middle-aged         Medium   5.0
5   6    Frank   42  Los Angeles     82          Old           High   4.0
6   7    Grace   29      Chicago     74        Young         Medium   7.0
7   8   Hannah   24      Chicago     66        Young         Medium   9.0
8   9      Ivy   41     New York     89          Old           High   2.0
9  10     Jack   28  Los Angeles     77        Young         Medium   6.0

22. Find the number of individuals whose names start with the letter 'A'.

In [24]:
individuals_A_name = data[data["Name"].str.startswith("A")]
individuals_A_name

   ID   Name  Age      City  Score Age Group Score Category  Rank
0   1  Alice   23  New York     85     Young           High   3.0

23. Determine the youngest individual in the dataset.

In [25]:
youngest_individual = data.sort_values(by="Age").iloc[0]
youngest_individual

ID                       1
Name                 Alice
Age                     23
City              New York
Score                   85
Age Group            Young
Score Category        High
Rank                   3.0
Name: 0, dtype: object

24. Calculate the sum of all scores in the dataset.

In [26]:
score_sum = data["Score"].sum()
score_sum

756

25. Group the dataset by 'City' and find the average age and average score for each city.

In [27]:
average_age_score_city = data.groupby("City")[["Age", "Score"]].mean()
average_age_score_city

                   Age      Score
City
Chicago      29.333333  61.666667
Los Angeles  38.333333  75.333333
New York     30.500000  86.250000

26. Filter the dataset to find individuals whose names have more than 5 characters.

In [28]:
user_longnames_data = data[data["Name"].str.len() > 5]
user_longnames_data

   ID     Name  Age      City  Score Age Group Score Category  Rank
2   3  Charlie   25  New York     93     Young           High   1.0
7   8   Hannah   24   Chicago     66     Young         Medium   9.0

27. Find the variance in scores for individuals in each age group.

In [29]:
score_variance_age_group = data.groupby("Age Group")["Score"].var()
score_variance_age_group

Age Group
Middle-aged    544.500000
Old            126.333333
Young          107.500000
Name: Score, dtype: float64

28. Identify the city with the most individuals.

In [30]:
most_populated_city = data["City"].value_counts().idxmax()
most_populated_city

'New York'

29. Calculate the average score of individuals aged between 30 and 40 (inclusive).

In [31]:
avg_score_30_40_age = data[(data["Age"] > 30) & (data["Age"] <= 40)]["Score"].mean()
avg_score_30_40_age

61.5

30. Find the top 2 cities with the highest average age of their residents.

In [32]:
top2_aged_cities = data.groupby("City")["Age"].mean().nlargest(2).index.tolist()
top2_aged_cities

['Los Angeles', 'New York']

31. For each city, find the individual with the lowest score.

In [33]:
lowest_scorers_data = data.loc[data.groupby("City")["Score"].idxmin().values]
lowest_scorers_data

   ID   Name  Age         City  Score    Age Group Score Category  Rank
3   4  David   35      Chicago     45  Middle-aged            Low  10.0
1   2    Bob   45  Los Angeles     67          Old         Medium   8.0
4   5    Eva   33     New York     78  Middle-aged         Medium   5.0

32. Determine if there's a significant difference in the average scores of individuals living in 'New York' vs. 'Los Angeles' using a suitable statistical test.

In [34]:
delta_avg_ny_la = (
    data[data["City"] == "New York"]["Score"].mean()
    - data[data["City"] == "Los Angeles"]["Score"].mean()
)
delta_avg_ny_la

10.916666666666671

33. Create a column 'Normalized Score' where each individual's score is normalized within their respective city.

In [35]:
city_normalize_score = data.groupby("City").apply(
    lambda row: (row["Score"] - row["Score"].mean()) / row["Score"].std()
)
city_normalize_score

/var/folders/3t/7vty8fs14dx8q_szrq7gcm5m0000gq/T/ipykernel_90663/18668673.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  city_normalize_score = data.groupby("City").apply(

City
Chicago      3   -1.112761
             6    0.823443
             7    0.289318
Los Angeles  1   -1.091089
             5    0.872872
             9    0.218218
New York     0   -0.195416
             2    1.055246
             4   -1.289745
             8    0.429915
Name: Score, dtype: float64

34. Find the individual(s) whose score deviates the most from the average score of their city.

In [36]:
max_deviation_avg = data.iloc[abs(data["Score"].mean() - data["Score"]).idxmax()]
max_deviation_avg

ID                          4
Name                    David
Age                        35
City                  Chicago
Score                      45
Age Group         Middle-aged
Score Category            Low
Rank                     10.0
Name: 3, dtype: object

35. Identify if there's a significant correlation between 'Age' and 'Score' across the entire dataset, and interpret the result.

In [37]:
age_score_corr = data["Age"].corr(data["Score"])
age_score_corr

-0.14743434742215916

36. Create a summary table that shows the count, mean, median, and standard deviation of ages and scores for each city and each age group.

In [38]:
data[["Age", "Score"]].describe()

             Age      Score
count  10.000000  10.000000
mean   32.500000  75.600000
std     8.003471  13.841965
min    23.000000  45.000000
25%    25.750000  68.750000
50%    31.000000  77.500000
75%    39.500000  84.250000
max    45.000000  93.000000

# Question 2

In [39]:
import pandas as pd
import numpy as np
import datetime

# Creating a new sample dataset
data = {
    "ID": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "Name": [
        "Alice",
        "Bob",
        "Charlie",
        "David",
        "Eva",
        "Frank",
        "Grace",
        "Hannah",
        "Ivy",
        "Jack",
    ],
    "Email": [
        "alice@example.com",
        "bob@example.com",
        "charlie@example.com",
        "david@example.com",
        "eva@example.com",
        "frank@example.com",
        "grace@example.com",
        "hannah@example.com",
        "ivy@example.com",
        "jack@example.com",
    ],
    "SignupDate": pd.to_datetime(
        [
            "2023-01-15",
            "2023-02-20",
            "2023-03-05",
            "2023-01-25",
            "2023-04-18",
            "2023-02-10",
            "2023-05-22",
            "2023-03-11",
            "2023-06-14",
            "2023-07-19",
        ]
    ),
    "Preferences": [
        {"newsletter": True, "sms": False},
        {"newsletter": False, "sms": True},
        {"newsletter": True, "sms": True},
        {"newsletter": False, "sms": False},
        {"newsletter": True, "sms": True},
        {"newsletter": False, "sms": True},
        {"newsletter": True, "sms": False},
        {"newsletter": True, "sms": False},
        {"newsletter": False, "sms": False},
        {"newsletter": True, "sms": True},
    ],
    "PurchaseAmount": [
        250.5,
        320.0,
        120.0,
        75.0,
        560.5,
        310.0,
        85.0,
        45.5,
        680.0,
        125.0,
    ],
}

data = pd.DataFrame(data)
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0

## Useful Functions

In [40]:
newsletter_users = data.apply(lambda x: x["Preferences"]["newsletter"], axis=1)
sms_users = data.apply(lambda x: x["Preferences"]["sms"], axis=1)

37. Find all individuals who signed up in the month of March 2023.

In [41]:
march_signed_up = data[data["SignupDate"].dt.month == 3]
march_signed_up

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5

38. Calculate the total purchase amount for all individuals.

In [42]:
total_purchase_amount = data["PurchaseAmount"].sum()
total_purchase_amount

2571.5

39. Filter the dataset to find individuals who have opted in for the newsletter.

In [43]:
newsletter_individuals = data[newsletter_users]
newsletter_individuals

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0

40. Add a new column 'EmailDomain' to the dataset which extracts the domain part of the email addresses.

In [44]:
data["EmailDomain"] = data["Email"].str.split(".", expand=True)[1]
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com

41. Calculate the average purchase amount for individuals who have signed up for SMS notifications.

In [45]:
sms_mean_purchase_amount = data[sms_users]["PurchaseAmount"].mean()
sms_mean_purchase_amount

287.1

42. Find the individuals who have signed up after March 1, 2023, and have a purchase amount greater than 100.

In [46]:
march1_pruchase_amount_gt100 = data[
    (data["SignupDate"] == "2023-03-01") & (data["PurchaseAmount"] > 100)
]
march1_pruchase_amount_gt100

Empty DataFrame
Columns: [ID, Name, Email, SignupDate, Preferences, PurchaseAmount, EmailDomain]
Index: []

43. Identify the individual with the highest purchase amount and their signup date.

In [47]:
higest_purchaser_signup_date = data[
    data["PurchaseAmount"] == data["PurchaseAmount"].max()
]["SignupDate"]
higest_purchaser_signup_date

8   2023-06-14
Name: SignupDate, dtype: datetime64[ns]

44. Find the difference in days between the signup date and a reference date (e.g., '2023-08-01') for each individual.

In [48]:
data["delta_signup_reference"] = (data["SignupDate"] - pd.Timestamp(2023, 8, 1)).dt.days
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain,delta_signup_reference
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com,-198
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com,-162
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com,-149
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com,-188
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com,-105
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com,-172
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com,-71
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com,-143
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com,-48
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com,-13

45. Create a new column 'SignupMonth' which contains the month and year of the signup date, then find the total purchase amount for each month.

In [49]:
data["SignupMonth"] = data["SignupDate"].dt.strftime("%Y-%m")
total_purchase_per_month = data.groupby("SignupMonth")["PurchaseAmount"].sum()
total_purchase_per_month

SignupMonth
2023-01    325.5
2023-02    630.0
2023-03    165.5
2023-04    560.5
2023-05     85.0
2023-06    680.0
2023-07    125.0
Name: PurchaseAmount, dtype: float64

46. Determine the individual(s) with the closest purchase amount to the average purchase amount.

In [50]:
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain,delta_signup_reference,SignupMonth
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com,-198,2023-01
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com,-162,2023-02
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com,-149,2023-03
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com,-188,2023-01
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com,-105,2023-04
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com,-172,2023-02
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com,-71,2023-05
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com,-143,2023-03
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com,-48,2023-06
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com,-13,2023-07

47. For each preference (newsletter and SMS), calculate the total and average purchase amounts.

In [51]:
# newsletter users
total_newsletters_users_purchase = data[newsletter_users]["PurchaseAmount"].sum()
avg_newsletters_users_purchase = data[newsletter_users]["PurchaseAmount"].mean()
print(
    f"Total Newsletters Users Purchase Amount= {total_newsletters_users_purchase}\nAvg Newsletters Users Purchase Amount = {avg_newsletters_users_purchase}"
)

# sms users
total_sms_users_purchase = data[sms_users]["PurchaseAmount"].sum()
avg_sms_users_purchase = data[sms_users]["PurchaseAmount"].mean()
print(
    f"Total SMS Users Purchase Amount= {total_sms_users_purchase}\nAvg SMS Users Purchase Amount = {avg_sms_users_purchase}"
)

# newsletter and sms users
total_newsletters_sms_users_purchase = data[(newsletter_users) & (sms_users)][
    "PurchaseAmount"
].sum()
avg_newsletters_sms_users_purchase = data[(newsletter_users) & (sms_users)][
    "PurchaseAmount"
].mean()

print(
    f"Total Newsletters & Sms Users Purchase Amount= {total_newsletters_sms_users_purchase}\nAvg Newsletters & Sms Users Purchase Amount = {avg_newsletters_sms_users_purchase}"
)

Total Newsletters Users Purchase Amount= 1186.5
Avg Newsletters Users Purchase Amount = 197.75
Total SMS Users Purchase Amount= 1435.5
Avg SMS Users Purchase Amount = 287.1
Total Newsletters & Sms Users Purchase Amount= 805.5
Avg Newsletters & Sms Users Purchase Amount = 268.5

48. Create a column 'SignupDayOfWeek' that indicates the day of the week each individual signed up, then find the total purchase amount for each day of the week.

In [52]:
data["SignupDayOfWeek"] = data["SignupDate"].dt.dayofweek
data.groupby("SignupDayOfWeek")["PurchaseAmount"].sum()

SignupDayOfWeek
0    405.0
1    560.5
2    880.0
4    310.0
5     45.5
6    370.5
Name: PurchaseAmount, dtype: float64

49. Find the most common email domain and the total purchase amount associated with it.

In [53]:
most_common_email_domain = data["EmailDomain"].value_counts().index[0]
total_purchase_amount_common_domain = (
    data.groupby("EmailDomain")
    .get_group(most_common_email_domain)["PurchaseAmount"]
    .sum()
)
total_purchase_amount_common_domain

2571.5

50. Determine if there's a significant difference in purchase amounts between individuals who opted in for the newsletter vs. those who didn't using a suitable statistical test.

In [54]:
delta_newsletter_non_users_purchase_amount = (
    data[newsletter_users]["PurchaseAmount"].sum()
    - data[~newsletter_users]["PurchaseAmount"].sum()
)
delta_newsletter_non_users_purchase_amount

-198.5

51. Create a summary table that shows the count, total purchase amount, and average purchase amount for each combination of 'SignupMonth' and 'Preferences'.

In [55]:
data = data.join(pd.json_normalize(data["Preferences"]))
summary_table = data.groupby(["SignupMonth", "newsletter", "sms"]).agg(
    {"PurchaseAmount": ["count", "sum", "mean"]}
)
summary_table

                             PurchaseAmount
                                      count    sum   mean
SignupMonth newsletter sms
2023-01     False      False              1   75.0   75.0
            True       False              1  250.5  250.5
2023-02     False      True               2  630.0  315.0
2023-03     True       False              1   45.5   45.5
                       True               1  120.0  120.0
2023-04     True       True               1  560.5  560.5
2023-05     True       False              1   85.0   85.0
2023-06     False      False              1  680.0  680.0
2023-07     True       True               1  125.0  125.0

52. Extract the first name and the domain from each email and create two new columns 'FirstName' and 'Domain'.

In [56]:
data["FirstName"] = data["Email"].str.split("@", expand=True)[0]
data["Domain"] = data["Email"].str.split(".", expand=True)[1]
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain,delta_signup_reference,SignupMonth,SignupDayOfWeek,newsletter,sms,FirstName,Domain
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com,-198,2023-01,6,True,False,alice,com
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com,-162,2023-02,0,False,True,bob,com
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com,-149,2023-03,6,True,True,charlie,com
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com,-188,2023-01,2,False,False,david,com
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com,-105,2023-04,1,True,True,eva,com
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com,-172,2023-02,4,False,True,frank,com
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com,-71,2023-05,0,True,False,grace,com
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com,-143,2023-03,5,True,False,hannah,com
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com,-48,2023-06,2,False,False,ivy,com
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com,-13,2023-07,2,True,True,jack,com

53. Calculate the total purchase amount for users who signed up in 2023 using a list comprehension.

In [57]:
lc_sum_amount = sum(
    [
        amount
        for amount, date in zip(data["PurchaseAmount"], data["SignupDate"])
        if date.year == 2023
    ]
)
lc_sum_amount

2571.5

54. Use a lambda function to create a new column 'Discount' which gives a 10% discount on 'PurchaseAmount' if 'PurchaseAmount' is greater than 300.

In [58]:
data["Discount"] = data.apply(
    lambda x: x["PurchaseAmount"] * 0.1 if x["PurchaseAmount"] > 300 else np.nan, axis=1
)
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain,delta_signup_reference,SignupMonth,SignupDayOfWeek,newsletter,sms,FirstName,Domain,Discount
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com,-198,2023-01,6,True,False,alice,com,NaN
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com,-162,2023-02,0,False,True,bob,com,32.00
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com,-149,2023-03,6,True,True,charlie,com,NaN
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com,-188,2023-01,2,False,False,david,com,NaN
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com,-105,2023-04,1,True,True,eva,com,56.05
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com,-172,2023-02,4,False,True,frank,com,31.00
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com,-71,2023-05,0,True,False,grace,com,NaN
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com,-143,2023-03,5,True,False,hannah,com,NaN
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com,-48,2023-06,2,False,False,ivy,com,68.00
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com,-13,2023-07,2,True,True,jack,com,NaN

55. Group the dataset by whether the individual opted for the newsletter or not and calculate the average 'PurchaseAmount' for each group.

In [59]:
sum_newsletter_users = data.groupby(newsletter_users)["PurchaseAmount"].sum()
sum_newsletter_users

False    1385.0
True     1186.5
Name: PurchaseAmount, dtype: float64

56. Using apply and a custom function, add a new column 'HasLongName' that is True if the length of the 'Name' is greater than 5 characters and False otherwise.

In [60]:
def check_long_name(name: str):
    """checks if the name is longer than 5 characters

    Args:
        name (str): name of user

    Returns:
        bool: true if the name is longer than 5 characters, false otherwise
    """
    if len(name) > 5:
        return True

    if len(name) > 5:
        return True
    return False


data["HasLongName"] = data.apply(lambda row: check_long_name(row["Name"]), axis=1)
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain,delta_signup_reference,SignupMonth,SignupDayOfWeek,newsletter,sms,FirstName,Domain,Discount,HasLongName
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com,-198,2023-01,6,True,False,alice,com,NaN,False
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com,-162,2023-02,0,False,True,bob,com,32.00,False
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com,-149,2023-03,6,True,True,charlie,com,NaN,True
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com,-188,2023-01,2,False,False,david,com,NaN,False
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com,-105,2023-04,1,True,True,eva,com,56.05,False
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com,-172,2023-02,4,False,True,frank,com,31.00,False
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com,-71,2023-05,0,True,False,grace,com,NaN,False
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com,-143,2023-03,5,True,False,hannah,com,NaN,True
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com,-48,2023-06,2,False,False,ivy,com,68.00,False
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com,-13,2023-07,2,True,True,jack,com,NaN,False

57. Use dictionary comprehension to create a dictionary where keys are names and values are the corresponding 'PurchaseAmount'.

In [61]:
name_amount_mapping = {
    name: amount for name, amount in zip(data["Name"], data["PurchaseAmount"])
}
name_amount_mapping

{'Alice': 250.5,
 'Bob': 320.0,
 'Charlie': 120.0,
 'David': 75.0,
 'Eva': 560.5,
 'Frank': 310.0,
 'Grace': 85.0,
 'Hannah': 45.5,
 'Ivy': 680.0,
 'Jack': 125.0}

58. Find the total purchase amount for each month using groupby on the 'SignupDate' after extracting the month.

In [62]:
data["Month"] = data["SignupDate"].dt.month
monthly_purchases = data.groupby("Month")["PurchaseAmount"].sum()
monthly_purchases

Month
1    325.5
2    630.0
3    165.5
4    560.5
5     85.0
6    680.0
7    125.0
Name: PurchaseAmount, dtype: float64

59. Create a new column 'IsPreferred' using a lambda function, where the value is True if both newsletter and sms preferences are True, otherwise False.

In [63]:
data["isPreferred"] = (data["Preferences"].apply(lambda x: x["sms"])) & (
    data["Preferences"].apply(lambda x: x["newsletter"])
)
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain,delta_signup_reference,SignupMonth,SignupDayOfWeek,newsletter,sms,FirstName,Domain,Discount,HasLongName,Month,isPreferred
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com,-198,2023-01,6,True,False,alice,com,NaN,False,1,False
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com,-162,2023-02,0,False,True,bob,com,32.00,False,2,False
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com,-149,2023-03,6,True,True,charlie,com,NaN,True,3,True
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com,-188,2023-01,2,False,False,david,com,NaN,False,1,False
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com,-105,2023-04,1,True,True,eva,com,56.05,False,4,True
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com,-172,2023-02,4,False,True,frank,com,31.00,False,2,False
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com,-71,2023-05,0,True,False,grace,com,NaN,False,5,False
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com,-143,2023-03,5,True,False,hannah,com,NaN,True,3,False
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com,-48,2023-06,2,False,False,ivy,com,68.00,False,6,False
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com,-13,2023-07,2,True,True,jack,com,NaN,False,7,True

60. Use the apply method with a lambda function to create a new column 'SignupWeekday' which indicates the day of the week each individual signed up.

In [64]:
data["SignupWeekday"] = data["SignupDate"].dt.dayofweek
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain,delta_signup_reference,SignupMonth,SignupDayOfWeek,newsletter,sms,FirstName,Domain,Discount,HasLongName,Month,isPreferred,SignupWeekday
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com,-198,2023-01,6,True,False,alice,com,NaN,False,1,False,6
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com,-162,2023-02,0,False,True,bob,com,32.00,False,2,False,0
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com,-149,2023-03,6,True,True,charlie,com,NaN,True,3,True,6
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com,-188,2023-01,2,False,False,david,com,NaN,False,1,False,2
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com,-105,2023-04,1,True,True,eva,com,56.05,False,4,True,1
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com,-172,2023-02,4,False,True,frank,com,31.00,False,2,False,4
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com,-71,2023-05,0,True,False,grace,com,NaN,False,5,False,0
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com,-143,2023-03,5,True,False,hannah,com,NaN,True,3,False,5
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com,-48,2023-06,2,False,False,ivy,com,68.00,False,6,False,2
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com,-13,2023-07,2,True,True,jack,com,NaN,False,7,True,2

61. Find the average purchase amount of users who have the word "example" in their email domain using string operations and the any function.

In [65]:
avg_purchase_amount_example_domain_users = data[data["Email"].str.contains("example")][
    "PurchaseAmount"
].mean()
avg_purchase_amount_example_domain_users

257.15

62. Using groupby and apply, create a column that ranks users within their signup month based on their 'PurchaseAmount' (1 being the highest purchase).

In [66]:
data["MonthlyPurchaseRank"] = data.groupby("SignupMonth")["PurchaseAmount"].rank(
    ascending=False, method="first"
)
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain,delta_signup_reference,SignupMonth,SignupDayOfWeek,newsletter,sms,FirstName,Domain,Discount,HasLongName,Month,isPreferred,SignupWeekday,MonthlyPurchaseRank
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com,-198,2023-01,6,True,False,alice,com,NaN,False,1,False,6,1.0
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com,-162,2023-02,0,False,True,bob,com,32.00,False,2,False,0,1.0
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com,-149,2023-03,6,True,True,charlie,com,NaN,True,3,True,6,1.0
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com,-188,2023-01,2,False,False,david,com,NaN,False,1,False,2,2.0
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com,-105,2023-04,1,True,True,eva,com,56.05,False,4,True,1,1.0
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com,-172,2023-02,4,False,True,frank,com,31.00,False,2,False,4,2.0
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com,-71,2023-05,0,True,False,grace,com,NaN,False,5,False,0,1.0
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com,-143,2023-03,5,True,False,hannah,com,NaN,True,3,False,5,2.0
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com,-48,2023-06,2,False,False,ivy,com,68.00,False,6,False,2,1.0
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com,-13,2023-07,2,True,True,jack,com,NaN,False,7,True,2,1.0

63. Determine if all users who signed up after '2023-04-01' have a 'PurchaseAmount' greater than 50 using the all function.

In [67]:
users_purchase_amount_gt50 = data[
    (data["SignupDate"] == "2023-04-01") & (data["PurchaseAmount"] > 50)
]
users_purchase_amount_gt50

Empty DataFrame
Columns: [ID, Name, Email, SignupDate, Preferences, PurchaseAmount, EmailDomain, delta_signup_reference, SignupMonth, SignupDayOfWeek, newsletter, sms, FirstName, Domain, Discount, HasLongName, Month, isPreferred, SignupWeekday, MonthlyPurchaseRank]
Index: []

64. For each user, create a column 'PreferenceScore' which sums up the boolean values of the preferences (True = 1, False = 0) using dictionary comprehension and apply.

In [68]:
data["PreferenceSum"] = data["Preferences"].apply(lambda x: x["newsletter"] + x["sms"])
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain,delta_signup_reference,SignupMonth,SignupDayOfWeek,...,sms,FirstName,Domain,Discount,HasLongName,Month,isPreferred,SignupWeekday,MonthlyPurchaseRank,PreferenceSum
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com,-198,2023-01,6,...,False,alice,com,NaN,False,1,False,6,1.0,1
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com,-162,2023-02,0,...,True,bob,com,32.00,False,2,False,0,1.0,1
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com,-149,2023-03,6,...,True,charlie,com,NaN,True,3,True,6,1.0,2
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com,-188,2023-01,2,...,False,david,com,NaN,False,1,False,2,2.0,0
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com,-105,2023-04,1,...,True,eva,com,56.05,False,4,True,1,1.0,2
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com,-172,2023-02,4,...,True,frank,com,31.00,False,2,False,4,2.0,1
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com,-71,2023-05,0,...,False,grace,com,NaN,False,5,False,0,1.0,1
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com,-143,2023-03,5,...,False,hannah,com,NaN,True,3,False,5,2.0,1
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com,-48,2023-06,2,...,False,ivy,com,68.00,False,6,False,2,1.0,0
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com,-13,2023-07,2,...,True,jack,com,NaN,False,7,True,2,1.0,2

65. Find the user whose purchase amount is the closest to the median purchase amount using a combination of apply and lambda functions.

In [69]:
data.iloc[
    abs(data["PurchaseAmount"].median() - data["PurchaseAmount"]).sort_values().index[0]
]

ID                                                         1
Name                                                   Alice
Email                                      alice@example.com
SignupDate                               2023-01-15 00:00:00
Preferences               {'newsletter': True, 'sms': False}
PurchaseAmount                                         250.5
EmailDomain                                              com
delta_signup_reference                                  -198
SignupMonth                                          2023-01
SignupDayOfWeek                                            6
newsletter                                              True
sms                                                    False
FirstName                                              alice
Domain                                                   com
Discount                                                 NaN
HasLongName                                            False
Month                                                      1
isPreferred                                            False
SignupWeekday                                              6
MonthlyPurchaseRank                                      1.0
PreferenceSum                                              1
Name: 0, dtype: object

66. Create a new column 'DaysSinceSignup' that calculates the number of days since the 'SignupDate' to today using datetime operations.

In [70]:
data["DaysSinceSignup"] = (pd.Timestamp.now() - data["SignupDate"]).dt.days
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,EmailDomain,delta_signup_reference,SignupMonth,SignupDayOfWeek,...,FirstName,Domain,Discount,HasLongName,Month,isPreferred,SignupWeekday,MonthlyPurchaseRank,PreferenceSum,DaysSinceSignup
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,com,-198,2023-01,6,...,alice,com,NaN,False,1,False,6,1.0,1,519
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,com,-162,2023-02,0,...,bob,com,32.00,False,2,False,0,1.0,1,483
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,com,-149,2023-03,6,...,charlie,com,NaN,True,3,True,6,1.0,2,470
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,com,-188,2023-01,2,...,david,com,NaN,False,1,False,2,2.0,0,509
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,com,-105,2023-04,1,...,eva,com,56.05,False,4,True,1,1.0,2,426
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,com,-172,2023-02,4,...,frank,com,31.00,False,2,False,4,2.0,1,493
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,com,-71,2023-05,0,...,grace,com,NaN,False,5,False,0,1.0,1,392
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,com,-143,2023-03,5,...,hannah,com,NaN,True,3,False,5,2.0,1,464
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,com,-48,2023-06,2,...,ivy,com,68.00,False,6,False,2,1.0,0,369
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,com,-13,2023-07,2,...,jack,com,NaN,False,7,True,2,1.0,2,334

# Question 3

In [71]:
import pandas as pd
import numpy as np
import datetime as dt

# Creating a new sample dataset
data = {
    "ID": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "Name": [
        "Alice",
        "Bob",
        "Charlie",
        "David",
        "Eva",
        "Frank",
        "Grace",
        "Hannah",
        "Ivy",
        "Jack",
    ],
    "Email": [
        "alice@example.com",
        "bob@example.com",
        "charlie@example.com",
        "david@example.com",
        "eva@example.com",
        "frank@example.com",
        "grace@example.com",
        "hannah@example.com",
        "ivy@example.com",
        "jack@example.com",
    ],
    "SignupDate": pd.to_datetime(
        [
            "2023-01-15",
            "2023-02-20",
            "2023-03-05",
            "2023-01-25",
            "2023-04-18",
            "2023-02-10",
            "2023-05-22",
            "2023-03-11",
            "2023-06-14",
            "2023-07-19",
        ]
    ),
    "Preferences": [
        {"newsletter": True, "sms": False},
        {"newsletter": False, "sms": True},
        {"newsletter": True, "sms": True},
        {"newsletter": False, "sms": False},
        {"newsletter": True, "sms": True},
        {"newsletter": False, "sms": True},
        {"newsletter": True, "sms": False},
        {"newsletter": True, "sms": False},
        {"newsletter": False, "sms": False},
        {"newsletter": True, "sms": True},
    ],
    "PurchaseAmount": [
        250.5,
        320.0,
        120.0,
        75.0,
        560.5,
        310.0,
        85.0,
        45.5,
        680.0,
        125.0,
    ],
    "Age": [25, 34, 22, 45, 35, 23, 41, 29, 38, 27],
    "City": [
        "New York",
        "Los Angeles",
        "New York",
        "Chicago",
        "New York",
        "Los Angeles",
        "Chicago",
        "New York",
        "Los Angeles",
        "Chicago",
    ],
}

data = pd.DataFrame(data)
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,Age,City
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,25,New York
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,34,Los Angeles
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,22,New York
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,45,Chicago
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,35,New York
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,23,Los Angeles
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,41,Chicago
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,29,New York
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,38,Los Angeles
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,27,Chicago

67. Create a column 'PurchaseCategory' that categorizes each 'PurchaseAmount' as 'Low', 'Medium', or 'High' based on quantiles (0-33%, 34-66%, 67-100%). Analyze the distribution of these categories for each city.

In [72]:
data["PurchaseCategory"] = pd.qcut(
    data["PurchaseAmount"], 3, labels=["Low", "Medium", "High"]
)
data

,ID,Name,Email,SignupDate,Preferences,PurchaseAmount,Age,City,PurchaseCategory
0,1,Alice,alice@example.com,2023-01-15,"{'newsletter': True, 'sms': False}",250.5,25,New York,Medium
1,2,Bob,bob@example.com,2023-02-20,"{'newsletter': False, 'sms': True}",320.0,34,Los Angeles,High
2,3,Charlie,charlie@example.com,2023-03-05,"{'newsletter': True, 'sms': True}",120.0,22,New York,Medium
3,4,David,david@example.com,2023-01-25,"{'newsletter': False, 'sms': False}",75.0,45,Chicago,Low
4,5,Eva,eva@example.com,2023-04-18,"{'newsletter': True, 'sms': True}",560.5,35,New York,High
5,6,Frank,frank@example.com,2023-02-10,"{'newsletter': False, 'sms': True}",310.0,23,Los Angeles,High
6,7,Grace,grace@example.com,2023-05-22,"{'newsletter': True, 'sms': False}",85.0,41,Chicago,Low
7,8,Hannah,hannah@example.com,2023-03-11,"{'newsletter': True, 'sms': False}",45.5,29,New York,Low
8,9,Ivy,ivy@example.com,2023-06-14,"{'newsletter': False, 'sms': False}",680.0,38,Los Angeles,High
9,10,Jack,jack@example.com,2023-07-19,"{'newsletter': True, 'sms': True}",125.0,27,Chicago,Medium

68. Determine the average age of users who made purchases above the median purchase amount. Compare this average age across different cities.

In [73]:
median_purchase_amount = data["PurchaseAmount"].median()
average_age_gtq50amount = data[data["PurchaseAmount"] > median_purchase_amount][
    "Age"
].mean()
average_age_cities_gtq50 = (
    data[data["PurchaseAmount"] > median_purchase_amount].groupby("City")["Age"].mean()
)
average_age_cities_gtq50

City
Los Angeles    31.666667
New York       30.000000
Name: Age, dtype: float64

# Question 4

In [74]:
import pandas as pd
import numpy as np

# Seed for reproducibility
np.random.seed(42)

# Generate data
order_id = np.arange(1001, 1051)
customer_id = np.random.randint(100, 200, size=50)
order_date = pd.date_range(start="2023-01-01", periods=50, freq="D")
product_id = np.random.randint(1000, 1010, size=50)
quantity = np.random.randint(1, 10, size=50)
price_per_unit = np.random.uniform(10, 100, size=50).round(2)
discount = np.random.uniform(0, 0.3, size=50).round(2)
total_price = (quantity * price_per_unit * (1 - discount)).round(2)

# Create DataFrame
data = pd.DataFrame(
    {
        "order_id": order_id,
        "customer_id": customer_id,
        "order_date": order_date,
        "product_id": product_id,
        "quantity": quantity,
        "price_per_unit": price_per_unit,
        "discount": discount,
        "total_price": total_price,
    }
)

data

,order_id,customer_id,order_date,product_id,quantity,price_per_unit,discount,total_price
0,1001,151,2023-01-01,1001,8,34.49,0.10,248.33
1,1002,192,2023-01-02,1003,3,68.29,0.03,198.72
2,1003,114,2023-01-03,1008,3,10.05,0.28,21.71
3,1004,171,2023-01-04,1001,1,41.73,0.12,36.72
4,1005,160,2023-01-05,1009,5,37.43,0.16,157.21
5,1006,120,2023-01-06,1008,7,24.82,0.25,130.30
6,1007,182,2023-01-07,1009,9,58.07,0.20,418.10
7,1008,186,2023-01-08,1004,7,53.63,0.22,292.82
8,1009,174,2023-01-09,1001,9,72.32,0.06,611.83
9,1010,174,2023-01-10,1003,8,34.25,0.16,230.16
10,1011,187,2023-01-11,1006,2,31.97,0.21,50.51
11,1012,199,2023-01-12,1007,1,25.15,0.07,23.39
12,1013,123,2023-01-13,1002,7,29.69,0.05,197.44
13,1014,102,2023-01-14,1000,7,60.23,0.29,299.34
14,1015,121,2023-01-15,1003,8,46.35,0.15,315.18
15,1016,152,2023-01-16,1001,5,15.84,0.08,72.86
16,1017,101,2023-01-17,1007,3,32.85,0.30,68.98
17,1018,187,2023-01-18,1003,8,32.22,0.29,183.01
18,1019,129,2023-01-19,1001,6,72.67,0.17,361.90
19,1020,137,2023-01-20,1005,3,74.10,0.26,164.50
20,1021,101,2023-01-21,1005,1,23.33,0.06,21.93
21,1022,163,2023-01-22,1009,3,99.80,0.08,275.45
22,1023,159,2023-01-23,1003,5,34.01,0.21,134.34
23,1024,120,2023-01-24,1005,3,97.90,0.25,220.28
24,1025,132,2023-01-25,1001,1,46.99,0.26,34.77
25,1026,175,2023-01-26,1009,5,12.97,0.12,57.07
26,1027,157,2023-01-27,1001,7,41.06,0.27,209.82
27,1028,121,2023-01-28,1009,7,67.09,0.26,347.53
28,1029,188,2023-01-29,1003,9,71.26,0.28,461.76
29,1030,148,2023-01-30,1007,3,57.78,0.24,131.74
30,1031,190,2023-01-31,1006,7,50.30,0.20,281.68
31,1032,158,2023-02-01,1008,1,59.76,0.17,49.60
32,1033,141,2023-02-02,1007,4,63.34,0.11,225.49
33,1034,191,2023-02-03,1004,4,17.28,0.28,49.77
34,1035,159,2023-02-04,1001,5,43.27,0.29,153.61
35,1036,179,2023-02-05,1004,7,31.79,0.09,202.50
36,1037,114,2023-02-06,1007,7,82.28,0.09,524.12
37,1038,161,2023-02-07,1009,4,52.33,0.15,177.92
38,1039,161,2023-02-08,1008,7,98.51,0.13,599.93
39,1040,146,2023-02-09,1008,3,45.89,0.30,96.37
40,1041,161,2023-02-10,1000,6,83.48,0.05,475.84
41,1042,150,2023-02-11,1008,2,81.85,0.01,162.06
42,1043,154,2023-02-12,1006,9,23.56,0.15,180.23
43,1044,163,2023-02-13,1008,5,55.74,0.05,264.76
44,1045,102,2023-02-14,1007,6,72.62,0.11,387.79
45,1046,150,2023-02-15,1000,4,87.25,0.22,272.22
46,1047,106,2023-02-16,1007,7,39.34,0.22,214.80
47,1048,120,2023-02-17,1007,9,29.82,0.09,244.23
48,1049,172,2023-02-18,1002,7,74.00,0.16,435.12
49,1050,138,2023-02-19,1000,1,82.86,0.15,70.43

69. Find the total revenue generated by each product.

In [75]:
total_price_products = data["total_price"].sum()
total_price_products
total_price_per_product = data.groupby("product_id")["total_price"].sum()
total_price_per_product

11046.17

product_id
1000    1117.83
1001    1729.84
1002     632.56
1003    1523.17
1004     545.09
1005     406.71
1006     512.42
1007    1820.54
1008    1324.73
1009    1433.28
Name: total_price, dtype: float64

70. Calculate the average discount applied for each customer.

In [76]:
avg_discount_per_customer = data.groupby('customer_id').aggregate({'discount' : 'mean'})
avg_discount_per_customer

             discount
customer_id
101          0.180000
102          0.200000
106          0.220000
114          0.185000
120          0.196667
121          0.205000
123          0.050000
129          0.170000
132          0.260000
137          0.260000
138          0.150000
141          0.110000
146          0.300000
148          0.240000
150          0.115000
151          0.100000
152          0.080000
154          0.150000
157          0.270000
158          0.170000
159          0.250000
160          0.160000
161          0.110000
163          0.065000
171          0.120000
172          0.160000
174          0.110000
175          0.120000
179          0.090000
182          0.200000
186          0.220000
187          0.250000
188          0.280000
190          0.200000
191          0.280000
192          0.030000
199          0.070000

71. Identify the top 3 customers by total spending.

In [77]:
top_3_spendings_customers = data.groupby('customer_id').agg({'total_price' : 'sum'}).sort_values('total_price',ascending=False).head(3)
top_3_spendings_customers

             total_price
customer_id
161              1253.69
174               841.99
102               687.13

72. Determine the total revenue generated each month.

In [78]:
data["order_yearmonth"] = data["order_date"].dt.strftime("%Y-%m")
total_revenue_monthly = data.groupby("order_yearmonth")["total_price"].sum()
total_revenue_monthly

order_yearmonth
2023-01    6259.38
2023-02    4786.79
Name: total_price, dtype: float64

73. Find the most popular product (by quantity sold) for each month.

In [79]:
most_popular_product_per_month = (
    data.groupby(["order_yearmonth", "product_id"])
    .agg({"quantity": "sum"})
    .sort_values(["order_yearmonth", "quantity"], ascending=[True, False])
    .reset_index()
    .drop_duplicates("order_yearmonth")
)
most_popular_product_per_month

   order_yearmonth  product_id  quantity
0          2023-01        1003        41
10         2023-02        1007        33

74. Create a summary table showing the total quantity sold and total revenue for each product, alongside the average price per unit for the product.

In [80]:
summary_table = data.groupby("product_id").agg(
    {"quantity": "sum", "total_price": "sum", "price_per_unit": "mean"}
)
summary_table

            quantity  total_price  price_per_unit
product_id
1000              18      1117.83       78.455000
1001              42      1729.84       46.046250
1002              14       632.56       51.845000
1003              41      1523.17       47.730000
1004              18       545.09       34.233333
1005               7       406.71       65.110000
1006              18       512.42       35.276667
1007              40      1820.54       50.397500
1008              28      1324.73       53.802857
1009              33      1433.28       54.615000

75. Find all orders where the total price is above the 90th percentile.

In [81]:
q90_total_price = data["total_price"].quantile(0.9)
order_gtq90_price = data[data["total_price"] > q90_total_price]
order_gtq90_price

,order_id,customer_id,order_date,product_id,quantity,price_per_unit,discount,total_price,order_yearmonth
8,1009,174,2023-01-09,1001,9,72.32,0.06,611.83,2023-01
28,1029,188,2023-01-29,1003,9,71.26,0.28,461.76,2023-01
36,1037,114,2023-02-06,1007,7,82.28,0.09,524.12,2023-02
38,1039,161,2023-02-08,1008,7,98.51,0.13,599.93,2023-02
40,1041,161,2023-02-10,1000,6,83.48,0.05,475.84,2023-02

76. List all customers who placed more than one order and received an average discount greater than 15%.

In [82]:
duplicates_customer_id = data["customer_id"].duplicated()
customer_data = (
    data[duplicates_customer_id]
    .groupby("customer_id")
    .agg(discount=("discount", "mean"))
    .reset_index()
)
customer_data[customer_data["discount"] > 0.15]

    customer_id  discount
3           120      0.17
4           121      0.26
5           150      0.22
6           159      0.29
9           174      0.16
10          187      0.29

77. Create a new column that categorizes the orders into 'High Value' (total price > $500) and 'Low Value' (total price <= $500). Count how many orders fall into each category.

In [83]:
data["category_price"] = data.apply(
    lambda x: "High Value" if x["total_price"] > 500 else "Low Value", axis=1
)
data["category_price"].value_counts()

category_price
Low Value     47
High Value     3
Name: count, dtype: int64

78. Find the customer who received the highest average discount.

In [84]:
highest_avg_discount_customer = (
    data.groupby("customer_id")
    .apply(lambda x: x["discount"].mean())
    .sort_values(ascending=False)
    .head(1)
)
highest_avg_discount_customer

/var/folders/3t/7vty8fs14dx8q_szrq7gcm5m0000gq/T/ipykernel_90663/761052549.py:3: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  .apply(lambda x: x["discount"].mean())

customer_id
146    0.3
dtype: float64

79. Create a pivot table showing the total quantity sold for each product and each month.

In [85]:
total_quantity_product_monthly = pd.pivot_table(
    data=data,
    index=["product_id", "order_yearmonth"],
    values=["quantity"],
    aggfunc=["sum"],
)
total_quantity_product_monthly

                                sum
                           quantity
product_id order_yearmonth
1000       2023-01                7
           2023-02               11
1001       2023-01               37
           2023-02                5
1002       2023-01                7
           2023-02                7
1003       2023-01               41
1004       2023-01                7
           2023-02               11
1005       2023-01                7
1006       2023-01                9
           2023-02                9
1007       2023-01                7
           2023-02               33
1008       2023-01               10
           2023-02               18
1009       2023-01               29
           2023-02                4

80. Create a multi-index DataFrame with 'customer_id' and 'product_id' and calculate the total quantity and total spending for each combination.

In [86]:
new_data = data.set_index(['customer_id','product_id'])
total_quantity_spending_data = new_data.groupby(['customer_id','product_id']).agg({'quantity' : 'sum', 'total_price': 'sum'})
total_quantity_spending_data

                        quantity  total_price
customer_id product_id
101         1005               1        21.93
            1007               3        68.98
102         1000               7       299.34
            1007               6       387.79
106         1007               7       214.80
114         1007               7       524.12
            1008               3        21.71
120         1005               3       220.28
            1007               9       244.23
            1008               7       130.30
121         1003               8       315.18
            1009               7       347.53
123         1002               7       197.44
129         1001               6       361.90
132         1001               1        34.77
137         1005               3       164.50
138         1000               1        70.43
141         1007               4       225.49
146         1008               3        96.37
148         1007               3       131.74
150         1000               4       272.22
            1008               2       162.06
151         1001               8       248.33
152         1001               5        72.86
154         1006               9       180.23
157         1001               7       209.82
158         1008               1        49.60
159         1001               5       153.61
            1003               5       134.34
160         1009               5       157.21
161         1000               6       475.84
            1008               7       599.93
            1009               4       177.92
163         1008               5       264.76
            1009               3       275.45
171         1001               1        36.72
172         1002               7       435.12
174         1001               9       611.83
            1003               8       230.16
175         1009               5        57.07
179         1004               7       202.50
182         1009               9       418.10
186         1004               7       292.82
187         1003               8       183.01
            1006               2        50.51
188         1003               9       461.76
190         1006               7       281.68
191         1004               4        49.77
192         1003               3       198.72
199         1007               1        23.39

81. Find the rolling average price per unit for each product with a window of 5 days.

In [87]:
data.sort_values(by=['product_id','order_date']).groupby('product_id').rolling('5D',on='order_date')['total_price'].mean()

product_id  order_date
1000        2023-01-14    299.340000
            2023-02-10    475.840000
            2023-02-15    272.220000
            2023-02-19    171.325000
1001        2023-01-01    248.330000
            2023-01-04    142.525000
            2023-01-09    611.830000
            2023-01-16     72.860000
            2023-01-19    217.380000
            2023-01-25     34.770000
            2023-01-27    122.295000
            2023-02-04    153.610000
1002        2023-01-13    197.440000
            2023-02-18    435.120000
1003        2023-01-02    198.720000
            2023-01-10    230.160000
            2023-01-15    315.180000
            2023-01-18    249.095000
            2023-01-23    134.340000
            2023-01-29    461.760000
1004        2023-01-08    292.820000
            2023-02-03     49.770000
            2023-02-05    126.135000
1005        2023-01-20    164.500000
            2023-01-21     93.215000
            2023-01-24    135.570000
1006        2023-01-11     50.510000
            2023-01-31    281.680000
            2023-02-12    180.230000
1007        2023-01-12     23.390000
            2023-01-17     68.980000
            2023-01-30    131.740000
            2023-02-02    178.615000
            2023-02-06    374.805000
            2023-02-14    387.790000
            2023-02-16    301.295000
            2023-02-17    282.273333
1008        2023-01-03     21.710000
            2023-01-06     76.005000
            2023-02-01     49.600000
            2023-02-08    599.930000
            2023-02-09    348.150000
            2023-02-11    286.120000
            2023-02-13    174.396667
1009        2023-01-05    157.210000
            2023-01-07    287.655000
            2023-01-22    275.450000
            2023-01-26    166.260000
            2023-01-28    202.300000
            2023-02-07    177.920000
Name: total_price, dtype: float64